// переменные в js

// переменные в js - это хранилище данных
// тип переменной в js определяется компилятором автоматически исходя из присвоенного ей значения

let a; // переменной ничего не присвоено, тип переменной a будет undefined
let b = 1; // переменной присвоено число, тип переменной b будет number
let c = 'тестовая строка'; // переменной присвоена строка, тип переменной c будет string
let d = false; // переменной присвоено логическое значение, тип переменной d будет boolean
let i = {}; // переменной присвоен объект, тип переменной i будет object
let f = function () {}; // переменной присвоена функция, тип переменной f будет function

// объявить переменные можно с помощью ключевых слов let, const, var

var old = 5; // так объявляли переменные в js до 2015 года, устаревшее ключевое слово
const pi = 3.14; // так можно объявить переменную которую нельзя изменить